#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.service_accounts.google_service_account.service_accounts["chef-inspec-sa"]: Refreshing state... [id=projects/tdd-testing-environment/serviceAccounts/chef-inspec-sa@tdd-testing-environment.iam.gserviceaccount.com]
module.instance_service_account.google_service_account.service_accounts["custom-instance-sa"]: Refreshing state... [id=projects/tdd-testing-environment/serviceAccounts/custom-instance-sa@tdd-testing-environment.iam.gserviceaccount.com]
module.service_accounts.google_project_iam_member.project-roles["chef-inspec-sa-tdd-testing-environment=>roles/viewer"]: Refreshing state... [id=tdd-testing-environment/roles/viewer/serviceaccount:chef-inspec-sa@tdd-testing-environment.iam.gserviceaccount.com]
module.instance_service_account.data.template_file.keys["custom-instance-sa"]: Refreshing state... [id=e3b0c44298fc1c149afbf4c8996fb92427ae41e4649b934ca495991b7852b855]
module.service_accounts.data.template_file.keys["chef-inspec-sa"]: Refreshing state... [id=e3b0c44298fc1c149afbf4c8996fb92427ae41e4649b934ca495991b7852b855]
module.instance_service_account.google_project_iam_member.project-roles["custom-instance-sa-tdd-testing-environment=>roles/secretmanager.secretAccessor"]: Refreshing state... [id=tdd-testing-environment/roles/secretmanager.secretAccessor/serviceaccount:custom-instance-sa@tdd-testing-environment.iam.gserviceaccount.com]
google_compute_instance.scalesec: Refreshing state... [id=projects/tdd-testing-environment/zones/us-west1-a/instances/scalesec-test]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_instance.scalesec will be updated in-place
  ~ resource "google_compute_instance" "scalesec" {
        allow_stopping_for_update = true
        can_ip_forward            = false
        cpu_platform              = "Unknown CPU Platform"
        current_status            = "TERMINATED"
        deletion_protection       = false
        enable_display            = false
        guest_accelerator         = []
        id                        = "projects/tdd-testing-environment/zones/us-west1-a/instances/scalesec-test"
        instance_id               = "7504826701870697983"
        label_fingerprint         = "3MaM1ANwuOs="
        labels                    = {
            "data_classification" = "public"
            "environment"         = "test"
        }
        machine_type              = "n1-standard-1"
        metadata                  = {}
        metadata_fingerprint      = "T9Xl7bgIp_E="
        name                      = "scalesec-test"
        project                   = "tdd-testing-environment"
        resource_policies         = []
        self_link                 = "https://www.googleapis.com/compute/v1/projects/tdd-testing-environment/zones/us-west1-a/instances/scalesec-test"
        tags                      = []
        tags_fingerprint          = "42WmSpB8rSM="
        zone                      = "us-west1-a"

        boot_disk {
            auto_delete = true
            device_name = "persistent-disk-0"
            mode        = "READ_WRITE"
            source      = "https://www.googleapis.com/compute/v1/projects/tdd-testing-environment/zones/us-west1-a/disks/scalesec-test"

            initialize_params {
                image  = "https://www.googleapis.com/compute/v1/projects/debian-cloud/global/images/debian-9-stretch-v20200910"
                labels = {}
                size   = 10
                type   = "pd-standard"
            }
        }

        network_interface {
            name               = "nic0"
            network            = "https://www.googleapis.com/compute/v1/projects/tdd-testing-environment/global/networks/default"
            network_ip         = "10.138.0.2"
            subnetwork         = "https://www.googleapis.com/compute/v1/projects/tdd-testing-environment/regions/us-west1/subnetworks/default"
            subnetwork_project = "tdd-testing-environment"

            access_config {
                network_tier = "PREMIUM"
            }
        }

        scheduling {
            automatic_restart   = true
            on_host_maintenance = "MIGRATE"
            preemptible         = false
        }

      ~ service_account {
          ~ email  = "custom-instance-sa@tdd-testing-environment.iam.gserviceaccount.com" -> (known after apply)
            scopes = [
                "https://www.googleapis.com/auth/cloud-platform",
            ]
        }
    }

  # module.instance_service_account.google_project_iam_member.project-roles["custom-instance-sa-scalesec-dev=>roles/secretmanager.secretAccessor"] will be created
  + resource "google_project_iam_member" "project-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "scalesec-dev"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # module.instance_service_account.google_project_iam_member.project-roles["custom-instance-sa-tdd-testing-environment=>roles/secretmanager.secretAccessor"] will be destroyed
  - resource "google_project_iam_member" "project-roles" {
      - etag    = "BwWwdKaeNlk=" -> null
      - id      = "tdd-testing-environment/roles/secretmanager.secretAccessor/serviceaccount:custom-instance-sa@tdd-testing-environment.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:custom-instance-sa@tdd-testing-environment.iam.gserviceaccount.com" -> null
      - project = "tdd-testing-environment" -> null
      - role    = "roles/secretmanager.secretAccessor" -> null
    }

  # module.instance_service_account.google_service_account.service_accounts["custom-instance-sa"] must be replaced
-/+ resource "google_service_account" "service_accounts" {
        account_id   = "custom-instance-sa"
        description  = "The Service Account used by Our Test Instance"
        display_name = "Test Instance Service Account"
      ~ email        = "custom-instance-sa@tdd-testing-environment.iam.gserviceaccount.com" -> (known after apply)
      ~ id           = "projects/tdd-testing-environment/serviceAccounts/custom-instance-sa@tdd-testing-environment.iam.gserviceaccount.com" -> (known after apply)
      ~ name         = "projects/tdd-testing-environment/serviceAccounts/custom-instance-sa@tdd-testing-environment.iam.gserviceaccount.com" -> (known after apply)
      ~ project      = "tdd-testing-environment" -> "scalesec-dev" # forces replacement
      ~ unique_id    = "110472874157833498504" -> (known after apply)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @eric-gonzales, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*